"""
б) Задача. Вивести дані про книги, тираж яких не перевищує 10000 примірників.
Поля структури: Автор, Жанр, Назва, Тираж.
Олійник Богдан Сергійович 122\Д
"""
kniga = {
    'Гарри Поттер и философский камень':
        {
            'Жанр': 'Фэнтези',
            'Автор': 'Джоан Роулинг',
            'Тираж': 12000},
    'Чарлі та шоколадна фабрика':
        {
            'Жанр': 'Фэнтези',
            'Автор': 'Роальд Дал',
            'Тираж': 200},
    'Пригоди Тома Сойєра':
        {
            'Жанр': 'Роман',
            'Автор': 'Марк Твен',
            'Тираж': 6000},
}
for k in kniga.keys():
    if kniga[k]['Тираж'] < 10000:
        print(k,':',kniga[k])
